<!DOCTYPE html>
<html>

	<head>
		<link rel="preconnect" href="https://fonts.googleapis.com">
		<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
		<link href="https://fonts.googleapis.com/css2?family=Kanit:ital,wght@1,100&display=swap" rel="stylesheet">
		<link rel="stylesheet" type="text/css" href="/contenidos/css/styles.css">
		<link rel="icon" type="image/jpeg" href="img/icon.jpeg">
		<meta name="viewport" content="width=device-width, user-scalable=no, initial-scale=1.0, maxium-scale=1.0, minium-scale=1.0">
		<meta charset="UTF-8">
		<title>Ecuaciones</title>
	</head>

	<body>
		<div class="resolucion">
			<div class="box_1">
				<h1 align="center"> <a class="enlace-central" href="http://127.0.0.1:8080">Aprende matemáticas</a> </h1>
			</div>

			<div class="box_2">

				<ul>

					<li> <a href="#introduccion">Introducción</a> </li>
					<li> <a href="#Historia-de-la-ecuacion">Historia de las ecuaciones</a> </li>
					<li> <a href="#que-es-una-ecuacion">¿Qué es una ecuación?</a> </li>
					<li> <a href="#tipos-de-ecuaciones">Tipos de ecuaciones</a> </li>
					<li> <a href="#conclusion">Conclusión</a> </li>

				</ul>		

			</div>

			<div class="contenedor_1">

				<div class="box"></div>

				<div class="box_3">
					<div class="palabras">
						<h2 id="introduccion" align="center">Introducción</h2>

						<p>Hola Bienvenido/a, muchas gracias por visitar a mi p&aacute;gina, este es una p&aacute;gina dedicada al mundo de las matem&aacute;ticas, que daremos lo posible para dar una explicaci&oacute;n detallada y sencilla. Aqu&iacute; exploraremos los conceptos fundamentales y las diversas herramientas matem&aacute;ticas que son la base para comprender el universo que nos rodea.</p>

						<h2 id="Historia-de-la-ecuacion" align="center">Historia de las ecuaciones</h2>

						<p>En el siglo XVI a.C., los egipcios resolv&iacute;an problemas cotidianos como por ejemplo la repartici&oacute;n de cosechas, v&iacute;veres y de materiales. Equival&iacute;an a resolver ecuaciones algebraicas simples, pero como la notaci&oacute;n algebraica no existia, usaban un m&eacute;todo iterativo aproximado, llamado m&eacute;todo de la falsa posici&oacute;n.</p>

						<p>Los matem&aacute;ticos chinos de los principios de nuestra era escribieron el libro "Los nueve cap&iacute;tulos sobre el arte matem&aacute;tico", en el que plantearon diversos m&eacute;todos para resolver ecuaciones de primer y segundo grado, as&iacute; como sistemas de dos ecuaciones con dos ic&oacute;gnitas.</p>

						<p>El matem&aacute;tico griego Diofanto de Alejandr&iacute;a public&oacute; su Arithmetica en el siglo III tratando las ecuaciones de primer y segundo grado; fue uno de los primeros en utilizar s&iacute;mbolos para representar las ecuaciones. Tambi&eacute;n plante&oacute; las ecuaciones con soluciones enteras, llamadas en su honor ecuaciones diof&aacute;nticas.</p>

						<h2 id="que-es-una-ecuacion" align="center">¿Qué es una ecuación?</h2>

						<p>Una ecuaci&oacute;n es una igualdad matem&aacute;tica entre dos expresiones, denominadas miembros y separadas por el signo igual, en las que aparece elementos conocidos y inc&oacute;gnitas.</p>

						<center>
							<img class="image-adaptable" src="img/elementos_de_una_ecuacion.jpeg">
						</center>
						<p>Los elementos conocidos pueden ser números o coeficientes, constantes, entre otros. Y las inc&oacute;gnitas es un valor que no sabemos y que hacer todo un c&aacute;lculo, descubrimos el valor de la inc&oacute;gnita, una funci&oacute;n o vectores, matrices. Todo va dependiendo de que tipo de ecuaci&oacute;n estemos trabajando.

						<div class="box_4">

							<h2 id="tipos-de-ecuaciones" align="center">Tipos de ecuaciones</h2>

							<p>Las ecuaciones suelen clasificarse seg&uacute;n el tipo de operaciones necesarias para definir y seg&uacute;n el conjunto de n&uacute;meros sobre el que se busca la soluci&oacute;n. Entre los tipos m&aacute;s comunes est&aacute;n:</p>

							<ul>

								<li>Ecuaciones algebraicas

								<ul>

									<li><a href="ecuaciones-lineales.html">De primer grado o lineal</a></li>

									<li>De segundo grado o cuadr&aacute;ticas</li>

									<li>De tercer grado o c&uacute;bicas</li>

									<li>Diof&aacute;nticas o difantinas</li>

									<li>Racionales</li>

								</ul>

							<li>Ecuaciones transcendentes</li>

							<li>Ecuaciones diferenciales</li>

							<ul>

								<li>Ordinarias</li>

								<li>Derivadas parciales</li>

							</ul>

							<li>Ecuaciones integrales</li>

							<li>Ecuaciones funcionales</li>

							</ul>

						</div>

						<h2 id="conclusion" align="center">Conclusión</h2>

						<p>Te agradezco por leer mi blog, espero que hayas aprendido sobre lo que es una ecuaci&oacute;n y sus tipos. Y siempre recuerda que las matem&aacute;ticas est&aacute;n a nuestro alrededor y son esenciales para comprender el mundo.</p>

						<p align="center">Gracias por visitar mi página. Si quieres seguir apoyandome dale clicks a los anuncios, y luego lo cierras, solo con eso me apoyarías bastante <3</p>

					</div>

				</div>

			<div class="box"></div>

			</div>

		</div>

	</body>

</html>
